# SheetList

## Description
Returns the name of the saved view specified by index.

```pascal
FUNCTION SheetList(sheetIndex : INTEGER): STRING;
```

```python
def vs.SheetList(sheetIndex):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|sheetIndex|INTEGER|Index of the sheet|

## See Also
VS Functions:
SheetNum

## Version
Availability: from VectorWorks10.0

## Category
* Document Attributes